In [3]:
import pandas as pd
y = pd.Period('2023')
y.start_time

Timestamp('2023-01-01 00:00:00')

In [4]:
y.end_time

Timestamp('2023-12-31 23:59:59.999999999')

In [7]:
d = pd.Period('2016-02-28', freq='D')
d.end_time #end_time

Timestamp('2016-02-28 23:59:59.999999999')

In [12]:
h = pd.Period('2017-08-15 23:00:00',freq='H')
h.start_time #end_time

Timestamp('2017-08-15 23:00:00')

# Quarterly Period

In [15]:
q1 = pd.Period('2023Q1', freq='Q-JAN')
q1

Period('2023Q1', 'Q-JAN')

In [17]:
q1.end_time #start_time

Timestamp('2022-04-30 23:59:59.999999999')

# PeriodIndex and period_range

In [25]:
f = pd.period_range('2020','2023', freq='q')
f

PeriodIndex(['2020Q1', '2020Q2', '2020Q3', '2020Q4', '2021Q1', '2021Q2',
             '2021Q3', '2021Q4', '2022Q1', '2022Q2', '2022Q3', '2022Q4',
             '2023Q1'],
            dtype='period[Q-DEC]')

In [22]:
f = f[0].start_time # star_time of 2020Q1 first quater
f

Timestamp('2020-01-01 00:00:00')

# Walmart's fiscal year ends in Jan, below is how you generate walmart's fiscal quarters between 2011 and 2017

In [29]:
rng = pd.period_range('2020','2023', freq='Q-JAN')
rng

PeriodIndex(['2020Q4', '2021Q1', '2021Q2', '2021Q3', '2021Q4', '2022Q1',
             '2022Q2', '2022Q3', '2022Q4', '2023Q1', '2023Q2', '2023Q3',
             '2023Q4'],
            dtype='period[Q-JAN]')

# Processing Wal Mart's Financials

In [58]:
import pandas as pd
df = pd.read_csv("wmt.csv")
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [59]:
df.set_index("Line Item",inplace=True)
df = df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [60]:
df.index

Index(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='object')

In [65]:
df.index = pd.PeriodIndex(df.index, freq='Q-JAN')
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [67]:
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]')

In [70]:
df.index[0].start_time

Timestamp('2016-02-01 00:00:00')

In [74]:
df['Start Date'] = df.index.map(lambda  x:x.start_time)
df

Line Item  Revenue  Expenses  Profit Start Date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [77]:
df["End Date"]=df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit Start Date                      End Date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999